src/corners/david/input_validation.org
:PROPERTIES:
:ID:       C455E53B-BCC5-4DA2-BBDA-A50753A9D821
:END:

#+TITLE: User Input Validation
#+COURSE: CS240
#+AUTHOR: David Freifeld
#+LATEX_HEADER: \usepackage{geometry}

I chose the /buffer overflow/ example provided in the assignment that consisted of the following code:

#+begin_src C 
  #include "stdio.h"
  #include "string.h"
  
  int check_authentication(char *password) {
      int auth_flag = 0;
      char password_buffer[20];
  
      strcpy(password_buffer, password);
  
      if (strcmp(password_buffer, "password") == 0) {
          auth_flag = 1;
      }
  
      return auth_flag;
  }
  
  int main(int argc, char* argv[]) {
      if (argc < 2) {
          printf("Usage: %s <password>\n", argv[0]);
      }
  
      if (check_authentication(argv[1])) {
          printf("Access Granted.\n");
      } else {
          printf("Access Denied.\n");
      }
  }
#+end_src

# #+begin_note Why does this code use quotes in its #include statements?
# This page uses [[https://prismjs.com][prism.js]] and somewhere along the way it refuses to render lines with the triangle bracket notation. Technically, using quotes for including standard libraries is valid, it's just not the usual pratice.
# #+end_note

Intended usage would be to compile with =gcc buffer_overflow.c -o buffer_overflow= and run =./buffer_overflow password= to get an "Access Granted." message.

However, since the buffer is located immediately before the =auth_flag= variable used to check if a user has authenticated and =strcpy= copies the /entire/ user input to the buffer, you could input a string longer than 20 characters that would then overwrite the =auth_flag= variable. Additionally, since nonzero integers are "truthy" in C, this means that any ascii value except for the null character would do the trick. A user could accidentally gain access without intentionally attempting to be malicious by simply typing a password over 20 characters.

Compiling with =gcc -fno-stack-protector -D_FORTIFY_SOURCE=0 buffer_overflow.c -o buffer_overflow=  then running it with =./buffer_overflow aaaaaaaaaaaaaaaaaaaaa= yields "Access Granted."

* Potential Fixes
** =strncpy= 
You could replace =strcpy(password_buffer, password)= with =strncpy(password_buffer, password, 20)= to only copy 20 characters and ensure that it would not buffer overflow - but this would introduce another problem. Were a user to input a string longer than 20 characters it would only copy over the first 20 without any form of null terminator, so when the program tries to read this string, it will segfault.

You could rectify this by doing a manual check: after it copies a string, =strncpy= fills the rest of the buffer with 0, so if the final byte of a buffer is not a null terminator, =strncpy= didn't copy the entire string and you can gracefully error.

** =strcpy_s= 
You could use a function introduced in C11 called =strcpy_s= that takes a destination string, size, and source string, yet returns an error when the source string is longer than the size instead of naively copying over anyways. You could then handle the error and exit gracefully or ask for another input.

A version of the =check_authentication()= function that is improved in this way would look like the following: 
#+begin_src C 
  int check_authentication(char *password) {
    char password_buffer[20];  
    strcpy_s(password_buffer, 20, password);
    if (strcmp(password_buffer, "password") == 0) {
        return 1;
    } else {
        return 0;
    }  
  }
#+end_src

Unfortunately, this is an optional part of the C11 standard and is not supported in most ecosystems.

