docs/corners/david/input_validation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-31 Sun 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>User Input Validation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="David Freifeld" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">User Input Validation</h1> <h2 class="subtitle"></h2> <span class="author">David Freifeld</span> <span class="date">2021-10-31 Sun 12:33</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul><li><a class='backlink' href='cs240-index.html'>CS240 Index</a></li> </ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org9c578d5">1. Potential Fixes</a>
<ul>
<li><a href="#org32ba146">1.1. <code>strncpy</code></a></li>
<li><a href="#org639664d">1.2. <code>strcpy_s</code></a></li>
<li><a href="#orge20bcfa">1.3. Bonus: <code>auth_flag</code></a></li>
<li><a href="#org00474c4">1.4. Compile Options</a></li>
</ul>
</li>
<li><a href="#orge712e28">2. Legal/Ethical Consequences</a></li>
<li><a href="#orgba7c55d">3. Appendix: Improved Implementation</a>
<ul>
<li><a href="#orga57f310">3.1. Building This Code</a>
<ul>
<li><a href="#orgde1c7c5">3.1.1. Installing OpenSSL</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div></div>
</div>
<p>
I chose the <i>buffer overflow</i> example provided in the assignment that consisted of the following code:
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">"stdio.h"</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"string.h"</span>

<span class="org-type">int</span> <span class="org-function-name">check_authentication</span>(<span class="org-type">char</span> *<span class="org-variable-name">password</span>) {
    <span class="org-type">int</span> <span class="org-variable-name">auth_flag</span> = 0;
    <span class="org-type">char</span> <span class="org-variable-name">password_buffer</span>[20];

    strcpy(password_buffer, password);

    <span class="org-keyword">if</span> (strcmp(password_buffer, <span class="org-string">"password"</span>) == 0) {
        auth_flag = 1;
    }

    <span class="org-keyword">return</span> auth_flag;
}

<span class="org-type">int</span> <span class="org-function-name">main</span>(<span class="org-type">int</span> <span class="org-variable-name">argc</span>, <span class="org-type">char</span>* <span class="org-variable-name">argv</span>[]) {
    <span class="org-keyword">if</span> (argc &lt; 2) {
        printf(<span class="org-string">"Usage: %s &lt;password&gt;\n"</span>, argv[0]);
    }

    <span class="org-keyword">if</span> (check_authentication(argv[1])) {
        printf(<span class="org-string">"Access Granted.\n"</span>);
    } <span class="org-keyword">else</span> {
        printf(<span class="org-string">"Access Denied.\n"</span>);
    }
}
</pre>
</div>

<p>
Intended usage would be to compile with <code>gcc buffer_overflow.c -o buffer_overflow</code> and run <code>./buffer_overflow password</code> to get an "Access Granted." message.
</p>

<p>
However, since the buffer is located immediately before the <code>auth_flag</code> variable used to check if a user has authenticated and <code>strcpy</code> copies the <i>entire</i> user input to the buffer, you could input a string longer than 20 characters that would then overwrite the <code>auth_flag</code> variable. Additionally, since nonzero integers are "truthy" in C, this means that any ascii value except for the null character would do the trick. A user could accidentally gain access without intentionally attempting to be malicious by simply typing a password over 20 characters.
</p>

<p>
Compiling with <code>gcc -fno-stack-protector -D_FORTIFY_SOURCE=0 buffer_overflow.c -o buffer_overflow</code>  then running it with <code>./buffer_overflow aaaaaaaaaaaaaaaaaaaaa</code> yields "Access Granted."
</p>

<div id="outline-container-org9c578d5" class="outline-2">
<h2 id="org9c578d5"><span class="section-number-2">1</span> Potential Fixes</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org32ba146" class="outline-3">
<h3 id="org32ba146"><span class="section-number-3">1.1</span> <code>strncpy</code></h3>
<div class="outline-text-3" id="text-1-1">
<p>
You could replace <code>strcpy(password_buffer, password)</code> with <code>strncpy(password_buffer, password, 20)</code> to only copy 20 characters and ensure that it would not buffer overflow - but this would introduce another problem. Were a user to input a string longer than 20 characters it would only copy over the first 20 without any form of null terminator, so when the program tries to read this string, it will segfault.
</p>

<p>
You could rectify this by doing a manual check: after it copies a string, <code>strncpy</code> fills the rest of the buffer with 0, so if the final byte of a buffer is not a null terminator, <code>strncpy</code> didn't copy the entire string and you can gracefully error.
</p>
</div>
</div>

<div id="outline-container-org639664d" class="outline-3">
<h3 id="org639664d"><span class="section-number-3">1.2</span> <code>strcpy_s</code></h3>
<div class="outline-text-3" id="text-1-2">
<p>
You could use a function introduced in C11 called <code>strcpy_s</code> that takes a destination string, size, and source string, yet returns an error when the source string is longer than the size instead of naively copying over anyways. You could then handle the error and exit gracefully or ask for another input.
</p>

<p>
A version of the <code>check_authentication()</code> function that is improved in this way would look like the following: 
</p>
<div class="org-src-container">
<pre class="src src-C"><span class="org-type">int</span> <span class="org-function-name">check_authentication</span>(<span class="org-type">char</span> *<span class="org-variable-name">password</span>) {
  <span class="org-type">char</span> <span class="org-variable-name">password_buffer</span>[20];  
  strcpy_s(password_buffer, 20, password);
  <span class="org-keyword">if</span> (strcmp(password_buffer, <span class="org-string">"password"</span>) == 0) {
      <span class="org-keyword">return</span> 1;
  } <span class="org-keyword">else</span> {
      <span class="org-keyword">return</span> 0;
  }  
}
</pre>
</div>

<p>
Unfortunately, this is an optional part of the C11 standard and is not supported in most ecosystems.
</p>
</div>
</div>
