src/corners/david/input_validation.tex
% Created 2021-09-27 Mon 13:08
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{geometry}
\author{David Freifeld}
\date{\today}
\title{User Input Validation}
\hypersetup{
 pdfauthor={David Freifeld},
 pdftitle={User Input Validation},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
I chose the \emph{buffer overflow} example provided in the assignment that consisted of the following code:

\begin{verbatim}
#include "stdio.h"
#include "string.h"

int check_authentication(char *password) {
    int auth_flag = 0;
    char password_buffer[20];

    strcpy(password_buffer, password);

    if (strcmp(password_buffer, "password") == 0) {
	auth_flag = 1;
    }

    return auth_flag;
}

int main(int argc, char* argv[]) {
    if (argc < 2) {
	printf("Usage: %s <password>\n", argv[0]);
    }

    if (check_authentication("whee")) {
	printf("Access Granted.\n");
    } else {
	printf("Access Denied.\n");
    }
}
\end{verbatim}

\begin{note}
This page uses \href{https://prismjs.com}{prism.js} and somewhere along the way it refuses to render lines with the triangle bracket notation. Technically, using quotes for including standard libraries is valid, it's just not the usual pratice.
\end{note}

Intended usage would be to compile with \texttt{gcc buffer\_overflow.c -o buffer\_overflow} and run \texttt{./buffer\_overflow password} to get an "Access Granted." message.

However, since the buffer is located immediately before the \texttt{auth\_flag} variable used to check if a user has authenticated and \texttt{strcpy} copies the \emph{entire} user input to the buffer, you could input a string longer than 20 characters that would then overwrite the \texttt{auth\_flag} variable. Additionally, since nonzero integers are "truthy" in C, this means that any ascii value except for the null character would do the trick. A user could accidentally gain access without intentionally attempting to be malicious by simply typing a password over 20 characters.

Compiling with \texttt{gcc -fno-stack-protector -D\_FORTIFY\_SOURCE=0 buffer\_overflow.c -o buffer\_overflow}  then running it with \texttt{./buffer\_overflow aaaaaaaaaaaaaaaaaaaaa} yields "Access Granted."

\section*{Potential Fixes}
\label{sec:org0f83e4c}
\subsection*{\texttt{strncpy}}
\label{sec:org74b56c2}
You could replace \texttt{strcpy(password\_buffer, password)} with \texttt{strncpy(password\_buffer, password, 20)} to only copy 20 characters and ensure that it would not buffer overflow - but this would introduce another problem. Were a user to input a string longer than 20 characters it would only copy over the first 20 without any form of null terminator, so when the program tries to read this string, it will segfault.

You could rectify this by doing a manual check: after it copies a string, \texttt{strncpy} fills the rest of the buffer with 0, so if the final byte of a buffer is not a null terminator, \texttt{strncpy} didn't copy the entire string and you can gracefully error.

\subsection*{\texttt{strcpy\_s}}
\label{sec:orgc6bdf59}
You could use a function introduced in C11 called \texttt{strcpy\_s} that takes a destination string, size, and source string, yet returns an error when the source string is longer than the size instead of naively copying over anyways. You could then handle the error and exit gracefully or ask for another input.

A version of the \texttt{check\_authentication()} function that is improved in this way would look like the following: 
\begin{verbatim}
int check_authentication(char *password) {
  char password_buffer[20];  
  strcpy_s(password_buffer, 20, password);
  if (strcmp(password_buffer, "password") == 0) {
      return 1;
  } else {
      return 0;
  }  
}
\end{verbatim}

Unfortunately, this is an optional part of the C11 standard and is not supported in most ecosystems.
