src/corners/david/input_validation.org
** Bonus: =auth_flag= 
Additionally, easily exposing an =auth_flag= variable to be overwritten is providing more oppportunities for an exploit: the user could still attempt to overwrite the return value but removing the =auth_flag= variable both allows for some cleaner code and less exploit opportunities.

** Compile Options
Another (worse) way of fixing this would be to keep the same code but compile with options that trigger an exception when they detect a buffer overflow. One such option is =-fstack-protector= (which is enabled by default) and GCC will insert a "guard variable" to vulnerable functions and check if it has been changed at the end of said functions. If the the check finds it has been changed (and therefore a buffer overflow has occured) it issues an exception in the form of a SIGTRAP signal, stopping the process. Additionally, the =FORTIFY_SOURCE= macro is used to replace common string functional calls with safe versions that perform additional buffer overflow checks around string and memory functions by comparing the amount of memory that /should/ be copied to the amount of memory that is copied at runtime.

Comparing the assembly output of these programs allows you to see that this is what happens!

Inspecting the output when compiling without the =FORTIFY_SOURCE= output gives the expected result with a direct call to =strcpy=:
#+begin_src asm
  bl	_strcpy
#+end_src
Compiling with the =FORTIFY_SOURCE= defined yields the following call instead, showing how the compiler has 
#+begin_src asm
  bl	___strcpy_chk
#+end_src

Similarly, when inspecting the assembly output when compiling with =-fstack-protector= one can see how the compiler inserts a =___stack_chk_guard= variable into the code, with lines like the following being inserted into the top and bottom of the function!
#+begin_src asm
  adrp	x8, ___stack_chk_guard@GOTPAGE
  ldr	x8, [x8, ___stack_chk_guard@GOTPAGEOFF
#+end_src

* Legal/Ethical Consequences 

In 1988, Robert Morris created the first major computer worm, and as part of the worm's process to gain entry into a computer system, it utilized a /buffer overflow/ exploit in a network daemon called =fingerd= to execute custom shellcode. In essence, the exploit relied on sending a malicious buffer to the daemon that both overwrote the return address on the program's stack, causing it to run a function like =system()=, as well as set the parameters to the hijacked return address to custom VAX shellcode (where VAX was a common mainframe at the time). [[https://github.com/rapid7/metasploit-framework/blob/master/modules/exploits/bsd/finger/morris_fingerd_bof.rb][See a more modern implementation of this exploit in Ruby here.]]

Morris ultimately caused large economic damage, and was arrested under the Computer Fraud and Abuse Act of 1986 for "having knowingly accessed a computer without authorization or exceeding authorized access".

Were someone to similarly exploit this code today, the California Penal Code 502(c)(1-4) outlines how it is a crime to  "knowingly accesses...without permission... a computer, computer system, or computer network" and do any variety of activities ranging from causing the system to be used or accessing data on said systems. By using a buffer overflow to access a computer system without permission they would have commited a public offense.


