docs/corners/david/input_validation.html

<div id="outline-container-orge20bcfa" class="outline-3">
<h3 id="orge20bcfa"><span class="section-number-3">1.3</span> Bonus: <code>auth_flag</code></h3>
<div class="outline-text-3" id="text-1-3">
<p>
Additionally, easily exposing an <code>auth_flag</code> variable to be overwritten is providing more oppportunities for an exploit: the user could still attempt to overwrite the return value but removing the <code>auth_flag</code> variable both allows for some cleaner code and less exploit opportunities.
</p>
</div>
</div>

<div id="outline-container-org00474c4" class="outline-3">
<h3 id="org00474c4"><span class="section-number-3">1.4</span> Compile Options</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Another (worse) way of fixing this would be to keep the same code but compile with options that trigger an exception when they detect a buffer overflow. One such option is <code>-fstack-protector</code> (which is enabled by default) and GCC will insert a "guard variable" to vulnerable functions and check if it has been changed at the end of said functions. If the the check finds it has been changed (and therefore a buffer overflow has occured) it issues an exception in the form of a SIGTRAP signal, stopping the process. Additionally, the <code>FORTIFY_SOURCE</code> macro is used to replace common string functional calls with safe versions that perform additional buffer overflow checks around string and memory functions by comparing the amount of memory that <i>should</i> be copied to the amount of memory that is copied at runtime.
</p>

<p>
Comparing the assembly output of these programs allows you to see that this is what happens!
</p>

<p>
Inspecting the output when compiling without the <code>FORTIFY_SOURCE</code> output gives the expected result with a direct call to <code>strcpy</code>:
</p>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-function-name">bl</span>      _strcpy
</pre>
</div>
<p>
Compiling with the <code>FORTIFY_SOURCE</code> defined yields the following call instead, showing how the compiler has 
</p>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-function-name">bl</span>      ___strcpy_chk
</pre>
</div>

<p>
Similarly, when inspecting the assembly output when compiling with <code>-fstack-protector</code> one can see how the compiler inserts a <code>___stack_chk_guard</code> variable into the code, with lines like the following being inserted into the top and bottom of the function!
</p>
<div class="org-src-container">
<pre class="src src-asm"><span class="org-function-name">adrp</span>    <span class="org-keyword">x8</span>, ___stack_chk_guard@GOTPAGE
<span class="org-function-name">ldr</span>     <span class="org-keyword">x8</span>, [x8, ___stack_chk_guard@GOTPAGEOFF
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge712e28" class="outline-2">
<h2 id="orge712e28"><span class="section-number-2">2</span> Legal/Ethical Consequences</h2>
<div class="outline-text-2" id="text-2">
<p>
In 1988, Robert Morris created the first major computer worm, and as part of the worm's process to gain entry into a computer system, it utilized a <i>buffer overflow</i> exploit in a network daemon called <code>fingerd</code> to execute custom shellcode. In essence, the exploit relied on sending a malicious buffer to the daemon that both overwrote the return address on the program's stack, causing it to run a function like <code>system()</code>, as well as set the parameters to the hijacked return address to custom VAX shellcode (where VAX was a common mainframe at the time). <a href="https://github.com/rapid7/metasploit-framework/blob/master/modules/exploits/bsd/finger/morris_fingerd_bof.rb">See a more modern implementation of this exploit in Ruby here.</a>
</p>

<p>
Morris ultimately caused large economic damage, and was arrested under the Computer Fraud and Abuse Act of 1986 for "having knowingly accessed a computer without authorization or exceeding authorized access".
</p>

<p>
Were someone to similarly exploit this code today, the California Penal Code 502(c)(1-4) outlines how it is a crime to  "knowingly accesses&#x2026;without permission&#x2026; a computer, computer system, or computer network" and do any variety of activities ranging from causing the system to be used or accessing data on said systems. By using a buffer overflow to access a computer system without permission they would have commited a public offense.
</p>
</div>
</div>
