src/corners/david/input_validation.tex

\subsection*{Bonus: \texttt{auth\_flag}}
\label{sec:orgd8901e6}
Additionally, easily exposing an \texttt{auth\_flag} variable to be overwritten is providing more oppportunities for an exploit: the user could still attempt to overwrite the return value but removing the \texttt{auth\_flag} variable both allows for some cleaner code and less exploit opportunities.

\subsection*{Compile Options}
\label{sec:orgc0658df}
Another (worse) way of fixing this would be to keep the same code but compile with options that trigger an exception when they detect a buffer overflow. One such option is \texttt{-fstack-protector} (which is enabled by default) and GCC will insert a "guard variable" to vulnerable functions and check if it has been changed at the end of said functions. If the the check finds it has been changed (and therefore a buffer overflow has occured) it issues an exception in the form of a SIGTRAP signal, stopping the process. Additionally, the \texttt{FORTIFY\_SOURCE} macro is used to replace common string functional calls with safe versions that perform additional buffer overflow checks around string and memory functions by comparing the amount of memory that \emph{should} be copied to the amount of memory that is copied at runtime.

Comparing the assembly output of these programs allows you to see that this is what happens!

Inspecting the output when compiling without the \texttt{FORTIFY\_SOURCE} output gives the expected result with a direct call to \texttt{strcpy}:
\begin{verbatim}
bl	_strcpy
\end{verbatim}
Compiling with the \texttt{FORTIFY\_SOURCE} defined yields the following call instead, showing how the compiler has 
\begin{verbatim}
bl	___strcpy_chk
\end{verbatim}

Similarly, when inspecting the assembly output when compiling with \texttt{-fstack-protector} one can see how the compiler inserts a \texttt{\_\_\_stack\_chk\_guard} variable into the code, with lines like the following being inserted into the top and bottom of the function!
\begin{verbatim}
adrp	x8, ___stack_chk_guard@GOTPAGE
ldr	x8, [x8, ___stack_chk_guard@GOTPAGEOFF
\end{verbatim}

\section*{Legal/Ethical Consequences}
\label{sec:org180a675}

In 1988, Robert Morris created the first major computer worm, and as part of the worm's process to gain entry into a computer system, it utilized a \emph{buffer overflow} exploit in a network daemon called \texttt{fingerd} to execute custom shellcode. In essence, the exploit relied on sending a malicious buffer to the daemon that both overwrote the return address on the program's stack, causing it to run a function like \texttt{system()}, as well as set the parameters to the hijacked return address to custom VAX shellcode (where VAX was a common mainframe at the time). \href{https://github.com/rapid7/metasploit-framework/blob/master/modules/exploits/bsd/finger/morris\_fingerd\_bof.rb}{See a more modern implementation of this exploit in Ruby here.}

Morris ultimately caused large economic damage, and was arrested under the Computer Fraud and Abuse Act of 1986 for "having knowingly accessed a computer without authorization or exceeding authorized access".

Were someone to similarly exploit this code today, the California Penal Code 502(c)(1-4) outlines how it is a crime to  "knowingly accesses\ldots{}without permission\ldots{} a computer, computer system, or computer network" and do any variety of activities ranging from causing the system to be used or accessing data on said systems. By using a buffer overflow to access a computer system without permission they would have commited a public offense.
