src/corners/david/input_validation.org
* Appendix: Improved Implementation
This implementation incorporates some of the aforementoined solutions (namely removing =auth_flag= and using =strncpy= with checks) as well as a bonus fix that is unrelated to user input validation. Storing the valid password in plaintext within the code is insecure since the string literal would appear in the binary as well, so a malicious user could run the common shell utility =strings= and figure out the valid password. Instead, we can store the hash of the password and compare that so that the user is unable to gleam any valuable information from the binary.

#+begin_src C
  #include "string.h"
  #include "assert.h"
  #include "stdio.h"
  #include "stdint.h"
  // for SHA-3 
  #include "openssl/evp.h"
  #include "openssl/sha.h"
  
  typedef enum auth_return {
      AUTH_VALID, // Correct password.
      AUTH_INVALID, // Invalid password.
      AUTH_ERRSIZE, // Password too long.
      AUTH_ERRALLOC, // Could not allocate buffer.
      AUTH_ERRDIGEST, // Could not hash password.
  } auth_return_t;
  
  #define PASS_BUFSIZE 20
  // Store hash as raw byte array for easy comparison.
  uint8_t valid_hash[64] = {222, 153, 123, 216, 88, 4, 200, 73, 47, 147, 188, 49, 118, 54, 10, 70, 243, 77, 56, 244, 11, 3, 93, 30, 39, 6, 224, 245, 67, 238, 192, 180, 149, 199, 212, 170, 3, 71, 164, 183, 156, 60, 218, 200, 222, 136, 218, 54, 37, 179, 223, 38, 236, 46, 242, 12, 107, 234, 59, 127, 237, 213, 224, 253};
  
  // Checks whether the supplied password is valid.
  // Takes: string with password.
  // Returns: response code (see auth_return_t)
  auth_return_t check_authentication(const char* password) {
      char password_buffer[PASS_BUFSIZE];
      strncpy(password_buffer, password, PASS_BUFSIZE);
  
      // strcpy will always fill rest of buffer with null so if last char is not null
      // that means that user must have inputted a string longer than 20 characters.
      if (password_buffer[PASS_BUFSIZE-1] != '\0') return AUTH_ERRSIZE;
  
      // generate SHA-3 hash for inputted password
      // taken from https://stackoverflow.com/a/62605880
      // begin by initializing the buffer and setting up SHA-3 boilerplate
      uint32_t digest_length = SHA512_DIGEST_LENGTH;
      const EVP_MD* algorithm = EVP_sha3_512();
      uint8_t* digest = (uint8_t*)(OPENSSL_malloc(digest_length));
      EVP_MD_CTX* context = EVP_MD_CTX_new();
      // if allocating either of these failed, error
      if (digest == NULL || context == NULL) return AUTH_ERRALLOC; 
  
      // generate digest, return error on first failed operation
      if (EVP_DigestInit_ex(context, algorithm, NULL) != 1 ||
          EVP_DigestUpdate(context, password, PASS_BUFSIZE) != 1 ||
          EVP_DigestFinal_ex(context, digest, &digest_length) != 1) {
          return AUTH_ERRDIGEST;
      }
  
      EVP_MD_CTX_destroy(context);
  
      // compare to valid hash
      printf("%d\n", digest_length);
      int cmp = memcmp(digest, valid_hash, digest_length);
      OPENSSL_free(digest);
  
      if (cmp == 0) {
          return AUTH_VALID;
      } else {
          return AUTH_INVALID;
      }
  }
  
  int main(int argc, char* argv[]) {
      if (argc < 2) {
          printf("Usage: %s <password>\n", argv[0]);
          return 1;
      }
  
      switch (check_authentication(argv[1])) {
      case AUTH_VALID: 
          printf("Access Granted.\n");
          break;
      case AUTH_INVALID:
          printf("Access Denied.\n");
          break;
      case AUTH_ERRSIZE:
          printf("Invalid password size!\n");
          break;
      case AUTH_ERRALLOC:
          printf("Out of memory!\n");
          break;
      case AUTH_ERRDIGEST:
          printf("Failed to hash password!\n");
          break;	
      }   
  }
#+end_src
** Building This Code
You'll need OpenSSL to compile this! Compiling the program is as simple as just compiling this C code with gcc but also linking against =libcrypto.a= like so:
#+begin_src sh
  gcc input.c <path-to-libcrypto.a> -o input
  ./input <password> 
#+end_src
The correct password is just "password".

