docs/corners/david/input_validation.html


<div id="outline-container-orgba7c55d" class="outline-2">
<h2 id="orgba7c55d"><span class="section-number-2">3</span> Appendix: Improved Implementation</h2>
<div class="outline-text-2" id="text-3">
<p>
This implementation incorporates some of the aforementoined solutions (namely removing <code>auth_flag</code> and using <code>strncpy</code> with checks) as well as a bonus fix that is unrelated to user input validation. Storing the valid password in plaintext within the code is insecure since the string literal would appear in the binary as well, so a malicious user could run the common shell utility <code>strings</code> and figure out the valid password. Instead, we can store the hash of the password and compare that so that the user is unable to gleam any valuable information from the binary.
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">"string.h"</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"assert.h"</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"stdio.h"</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"stdint.h"</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">for SHA-3 </span>
<span class="org-preprocessor">#include</span> <span class="org-string">"openssl/evp.h"</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"openssl/sha.h"</span>

<span class="org-keyword">typedef</span> <span class="org-keyword">enum</span> <span class="org-type">auth_return</span> {
    <span class="org-variable-name">AUTH_VALID</span>, <span class="org-comment-delimiter">// </span><span class="org-comment">Correct password.</span>
    <span class="org-variable-name">AUTH_INVALID</span>, <span class="org-comment-delimiter">// </span><span class="org-comment">Invalid password.</span>
    <span class="org-variable-name">AUTH_ERRSIZE</span>, <span class="org-comment-delimiter">// </span><span class="org-comment">Password too long.</span>
    <span class="org-variable-name">AUTH_ERRALLOC</span>, <span class="org-comment-delimiter">// </span><span class="org-comment">Could not allocate buffer.</span>
    <span class="org-variable-name">AUTH_ERRDIGEST</span>, <span class="org-comment-delimiter">// </span><span class="org-comment">Could not hash password.</span>
} <span class="org-type">auth_return_t</span>;

<span class="org-preprocessor">#define</span> <span class="org-variable-name">PASS_BUFSIZE</span> 20
<span class="org-comment-delimiter">// </span><span class="org-comment">Store hash as raw byte array for easy comparison.</span>
<span class="org-type">uint8_t</span> <span class="org-variable-name">valid_hash</span>[64] = {222, 153, 123, 216, 88, 4, 200, 73, 47, 147, 188, 49, 118, 54, 10, 70, 243, 77, 56, 244, 11, 3, 93, 30, 39, 6, 224, 245, 67, 238, 192, 180, 149, 199, 212, 170, 3, 71, 164, 183, 156, 60, 218, 200, 222, 136, 218, 54, 37, 179, 223, 38, 236, 46, 242, 12, 107, 234, 59, 127, 237, 213, 224, 253};

<span class="org-comment-delimiter">// </span><span class="org-comment">Checks whether the supplied password is valid.</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Takes: string with password.</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Returns: response code (see auth_return_t)</span>
<span class="org-type">auth_return_t</span> <span class="org-function-name">check_authentication</span>(<span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">password</span>) {
    <span class="org-type">char</span> <span class="org-variable-name">password_buffer</span>[PASS_BUFSIZE];
    strncpy(password_buffer, password, PASS_BUFSIZE);

    <span class="org-comment-delimiter">// </span><span class="org-comment">strcpy will always fill rest of buffer with null so if last char is not null</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">that means that user must have inputted a string longer than 20 characters.</span>
    <span class="org-keyword">if</span> (password_buffer[PASS_BUFSIZE-1] != <span class="org-string">'\0'</span>) <span class="org-keyword">return</span> AUTH_ERRSIZE;

    <span class="org-comment-delimiter">// </span><span class="org-comment">generate SHA-3 hash for inputted password</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">taken from https://stackoverflow.com/a/62605880</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">begin by initializing the buffer and setting up SHA-3 boilerplate</span>
    <span class="org-type">uint32_t</span> <span class="org-variable-name">digest_length</span> = SHA512_DIGEST_LENGTH;
    <span class="org-keyword">const</span> <span class="org-type">EVP_MD</span>* <span class="org-variable-name">algorithm</span> = EVP_sha3_512();
    <span class="org-type">uint8_t</span>* <span class="org-variable-name">digest</span> = (<span class="org-type">uint8_t</span>*)(OPENSSL_malloc(digest_length));
    <span class="org-type">EVP_MD_CTX</span>* <span class="org-variable-name">context</span> = EVP_MD_CTX_new();
    <span class="org-comment-delimiter">// </span><span class="org-comment">if allocating either of these failed, error</span>
    <span class="org-keyword">if</span> (digest == <span class="org-constant">NULL</span> || context == <span class="org-constant">NULL</span>) <span class="org-keyword">return</span> AUTH_ERRALLOC; 

    <span class="org-comment-delimiter">// </span><span class="org-comment">generate digest, return error on first failed operation</span>
    <span class="org-keyword">if</span> (EVP_DigestInit_ex(context, algorithm, <span class="org-constant">NULL</span>) != 1 ||
        EVP_DigestUpdate(context, password, PASS_BUFSIZE) != 1 ||
        EVP_DigestFinal_ex(context, digest, &amp;digest_length) != 1) {
        <span class="org-keyword">return</span> AUTH_ERRDIGEST;
    }

    EVP_MD_CTX_destroy(context);

    <span class="org-comment-delimiter">// </span><span class="org-comment">compare to valid hash</span>
    printf(<span class="org-string">"%d\n"</span>, digest_length);
    <span class="org-type">int</span> <span class="org-variable-name">cmp</span> = memcmp(digest, valid_hash, digest_length);
    OPENSSL_free(digest);

    <span class="org-keyword">if</span> (cmp == 0) {
        <span class="org-keyword">return</span> AUTH_VALID;
    } <span class="org-keyword">else</span> {
        <span class="org-keyword">return</span> AUTH_INVALID;
    }
}

<span class="org-type">int</span> <span class="org-function-name">main</span>(<span class="org-type">int</span> <span class="org-variable-name">argc</span>, <span class="org-type">char</span>* <span class="org-variable-name">argv</span>[]) {
    <span class="org-keyword">if</span> (argc &lt; 2) {
        printf(<span class="org-string">"Usage: %s &lt;password&gt;\n"</span>, argv[0]);
        <span class="org-keyword">return</span> 1;
    }

    <span class="org-keyword">switch</span> (check_authentication(argv[1])) {
    <span class="org-keyword">case</span> AUTH_VALID: 
        printf(<span class="org-string">"Access Granted.\n"</span>);
        <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> AUTH_INVALID:
        printf(<span class="org-string">"Access Denied.\n"</span>);
        <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> AUTH_ERRSIZE:
        printf(<span class="org-string">"Invalid password size!\n"</span>);
        <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> AUTH_ERRALLOC:
        printf(<span class="org-string">"Out of memory!\n"</span>);
        <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> AUTH_ERRDIGEST:
        printf(<span class="org-string">"Failed to hash password!\n"</span>);
        <span class="org-keyword">break</span>;  
    }   
}
</pre>
</div>
</div>
<div id="outline-container-orga57f310" class="outline-3">
<h3 id="orga57f310"><span class="section-number-3">3.1</span> Building This Code</h3>
<div class="outline-text-3" id="text-3-1">
<p>
You'll need OpenSSL to compile this! Compiling the program is as simple as just compiling this C code with gcc but also linking against <code>libcrypto.a</code> like so:
</p>
<div class="org-src-container">
<pre class="src src-sh">gcc input.c &lt;path-to-libcrypto.a&gt; -o input
./input &lt;password&gt; 
</pre>
</div>
<p>
The correct password is just "password".
</p>
</div>
