src/corners/david/input_validation.org
*** Installing OpenSSL
I installed it via Homebrew, with =brew install openssl@1.1=. Then, you can find the path to the =lib= folder by running =brew list openssl@1.1= and compile with something like this:
#+begin_src sh
  gcc input.c /opt/homebrew/Cellar/openssl@1.1/1.1.1l/lib/libcrypto.a -o input
  ./input <password> 
#+end_src
