docs/corners/david/input_validation.html

<div id="outline-container-orgde1c7c5" class="outline-4">
<h4 id="orgde1c7c5"><span class="section-number-4">3.1.1</span> Installing OpenSSL</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
I installed it via Homebrew, with <code>brew install openssl@1.1</code>. Then, you can find the path to the <code>lib</code> folder by running <code>brew list openssl@1.1</code> and compile with something like this:
</p>
<div class="org-src-container">
<pre class="src src-sh">gcc input.c /opt/homebrew/Cellar/openssl@1.1/1.1.1l/lib/libcrypto.a -o input
./input &lt;password&gt; 
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
